Revit 2026 API

# RebarInSystemQuantity Property

---

Identifies the number of bars in rebar set.

**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public int Quantity { get; }
```
```vb
Public ReadOnly Property Quantity As Integer
	Get
```
```cpp
public:
property int Quantity {
	int get ();
}
```
```fsharp
member Quantity : int with get
```

#### Property Value

Int32

Quantity is equal to NumberOfBarPositions if all the bars are included. If any bars are excluded, they are not counted in the Quantity.

#### Reference

RebarInSystem Class

Autodesk.Revit.DB.Structure Namespace